app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "event_admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(title: params[:title], description: params[:description], start_date: params[:start_date], duration: params[:duration], price: params[:price], location: params[:location], event_admin: current_user)

    if @event.save